// // Начало. Ананьев
Процедура ДобавитьКонтактноеЛицоНаФорму(Форма) Экспорт
    
    ЭлементДоговор = Форма.Элементы.Найти("Договор");
    Если ЭлементДоговор = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Родитель = ЭлементДоговор.Родитель;
    
    // Вставляем поле СРАЗУ ПОСЛЕ договора
    НовоеПоле = Форма.Элементы.Добавить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
    НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
    НовоеПоле.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
    НовоеПоле.Заголовок = "Контактное лицо";
    
    Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
    МассивСвязей = Новый Массив;
    МассивСвязей.Добавить(Связь);
    
    НовоеПоле.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
    
КонецПроцедуры
// // Конец. Ананьев