// // Начало. Ананьев
#Область ОбработчикиСобытий 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекущийКонтрагент = ПараметрКоманды;
	ПараметрыФормы = Новый Структура;
	
	ПараметрыОтбора = Новый Структура("Владелец", ТекущийКонтрагент);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ДЗ_КонтактныеЛица.ФормаСписка", 
	             ПараметрыФормы, 
	             ПараметрыВыполненияКоманды.Источник, 
	             ПараметрыВыполненияКоманды.Уникальность, 
	             ПараметрыВыполненияКоманды.Окно, 
	             ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти
// // Конец. Ананьев